#+TITLE: 学习使用 EIEIO

*** 生成对象

#+BEGIN_SRC elisp
(setq me (person :name user-full-name))
#+END_SRC

#+RESULTS:
: #s(person "Xu Chunyang" "2001-12-20" unbound)

用 oref 获得对象的 slot

#+BEGIN_SRC elisp
(oref me :name)
#+END_SRC

#+RESULTS:
: Xu Chunyang

#+BEGIN_SRC elisp
(oref me :birthday)
#+END_SRC

#+RESULTS:
: 2001-12-20

#+BEGIN_SRC elisp
;; 没设置并且没初值的 slot 不能使用
;; Unbound slot: person, "#<person person>", :phone, oref
(oref me :phone)
#+END_SRC

*** 定义类方法

cl-defmethod 参数中的 (NAME TYPE) 对表示变量名字和类型，只有符合类型是才能调用

#+BEGIN_SRC elisp
(cl-defmethod call-person ((pers person) &optional scriptname)
  "Dial the phone for the person PERS.
Execute the program SCRIPTNAME to dial the phone."
  (message "Dialing the phone for %s" (oref pers :name))
  (shell-command (concat (or scriptname "echo") " " (oref pers :phone))))
#+END_SRC

#+BEGIN_SRC elisp
(setq me (person :name user-full-name :phone "12345"))
(call-person me)
#+END_SRC

#+RESULTS:
: 0

(NAME TYPE) 并非必须是第一个参数

#+BEGIN_SRC elisp
(cl-defmethod say (prefix (pers person))
  "Say hi to TO."
  (message "%s, %s said" prefix (oref pers :name)))
#+END_SRC

#+RESULTS:
: say

#+BEGIN_SRC elisp
(say "This is the way" (person :name "a Mandalorian"))
#+END_SRC

#+RESULTS:
: This is the way, a Mandalorian said

** 定义类

用 defclass 定义一个类，它会自动生成一个类型判断函数 CLASS-NAME-p

#+BEGIN_SRC elisp
(defclass dog ()
  ()
  "A class for dogs.")

(list (dog-p "not a dog") (dog-p (dog)) (type-of (dog)))
#+END_SRC

#+RESULTS:
| nil | t | dog |

*** 继承 (inheritance)

定义一个基类

警告：这会把自带的 point 函数覆盖掉！！！
#+BEGIN_SRC elisp
(defclass point ()
  ((x :initarg :x)
   (y :initarg :y))
  "A 2D point class.")
#+END_SRC

#+RESULTS:
: point

继承这个基类

#+BEGIN_SRC elisp
(defclass circle (point)
  ((radius :initarg :radius))
  "A circle class.")
#+END_SRC

#+RESULTS:
: circle

#+BEGIN_SRC elisp
(setq c (circle :x 1 :y 2 :radius 3))
#+END_SRC

#+RESULTS:
: #s(circle 1 2 3)

#+BEGIN_SRC elisp
(list (oref c :x) (oref c :y) (oref c :radius))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

定义一个方法

#+BEGIN_SRC elisp
(cl-defmethod area ((c circle))
  "Return the area of the circle C."
  (* float-pi (expt (oref c :radius) 2)))

(area (circle :radius 10))
#+END_SRC

#+RESULTS:
: 314.1592653589793

不止是 slot，方法也会继承

#+BEGIN_SRC elisp
(defclass color-circle (circle)
  ((color :initarg :color))
  "A colorful circle class.")

(area (color-circle :color "green" :radius 1))
#+END_SRC

#+RESULTS:
: 3.141592653589793
** 定义对象

有两种方法：

- CLASS-NAME
- make-instance

#+BEGIN_SRC elisp
(defclass rabit ()
  ((color :initarg :color
          :initform "white")
   (age :initarg :age))
  "A class for rabits.")

(list (rabit :age 1)
      (make-instance 'rabit :age 2))
#+END_SRC

#+RESULTS:
| #s(rabit white 1) | #s(rabit white 2) |
** 存取 Slot

- oset :: 写入
- oref :: 读取

#+BEGIN_SRC elisp
(defclass point ()
  ((x :initarg :x)
   (y :initarg :y))
  "A 2D point class.")

(setq p (point :x 1 :y 2))
#+END_SRC

#+RESULTS:
: #s(point 1 2)

#+BEGIN_SRC elisp
(oref p :x)
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC elisp
(oset p :x 100)
(oref p :x)
#+END_SRC

#+RESULTS:
: 100

